openfoam/tutorials/lagrangian/reactingParcelFoam/rectangularChannel/Allrun
#!/bin/sh
cd "${0%/*}" || exit                                # Run from this directory
. ${WM_PROJECT_DIR:?}/bin/tools/RunFunctions        # Tutorial run functions
#------------------------------------------------------------------------------

restore0Dir

runApplication blockMesh

runApplication potentialFoam
# Remove incompatible (volumetric) flux field
rm -f 0/phi 2>/dev/null

runApplication $(getApplication)

#------------------------------------------------------------------------------
